source/InformationRegisters/VKROperatorDecisions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>VKROperatorDecisions</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Notification</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.OtpravkaUvedomleniya</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DecidedAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OperatorName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PreviousState</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VKRQueueStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NewState</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VKRQueueStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Reason</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>DecisionID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

source/InformationRegisters/VKRQueue.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>VKRQueue</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Event</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VKRQueueStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Attempts</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NextTry</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClaimToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClaimUntil</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LastError</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Notification</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.OtpravkaUvedomleniya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

source/Enums/VKRQueueStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>VKRQueueStates</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Prepared</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Retry</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Failed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unknown</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cancelled</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

source/CommonModules/VKROperator/Ext/Module.bsl
// Одно решение имеет постоянный идентификатор; перепроведение не меняет историю.
Процедура Решить(Знач Уведомление, Знач Решение, Знач Обоснование, Знач КлючРешения = "") Экспорт
    Если НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.VKROperatorDecisions) Тогда
        ВызватьИсключение "Недостаточно прав на решение по отправке.";
    КонецЕсли;
    Обоснование = СокрЛП(Обоснование);
    Если СтрДлина(Обоснование) < 10 Или СтрДлина(Обоснование) > 1000 Тогда
        ВызватьИсключение "Укажите результат проверки приёмника и основание решения: 10-1000 символов.";
    КонецЕсли;
    Если Решение <> "Retry" И Решение <> "Cancel" Тогда
        ВызватьИсключение "Неизвестная команда оператора.";
    КонецЕсли;
    ЦелевоеСостояние = ?(Решение = "Retry", Перечисления.VKRQueueStates.Retry, Перечисления.VKRQueueStates.Cancelled);
    Если ПустаяСтрока(КлючРешения) Тогда
        КлючРешения = Строка(Новый УникальныйИдентификатор);
    КонецЕсли;
    НачатьТранзакцию();
    Попытка
        VKROutbox.Заблокировать("VKRQueue", "Notification", Уведомление);
        ЗаписьРешения = РегистрыСведений.VKROperatorDecisions.СоздатьМенеджерЗаписи();
        ЗаписьРешения.DecisionID = КлючРешения;
        ЗаписьРешения.Прочитать();
        Если ЗаписьРешения.Выбран() Тогда
            Если ЗаписьРешения.Notification <> Уведомление
                Или ЗаписьРешения.NewState <> ЦелевоеСостояние
                Или ЗаписьРешения.Reason <> Обоснование Тогда
                ВызватьИсключение "Ключ решения уже использован для другого действия.";
            КонецЕсли;
        Иначе
            О = РегистрыСведений.VKRQueue.СоздатьМенеджерЗаписи();
            О.Notification = Уведомление;
            О.Прочитать();
            Если НЕ О.Выбран() Или (О.State <> Перечисления.VKRQueueStates.Unknown
                И О.State <> Перечисления.VKRQueueStates.Failed) Тогда
                ВызватьИсключение "Решение допускается для неизвестного результата или окончательной ошибки.";
            КонецЕсли;
            ИсходноеСостояние = О.State;
            Если Решение = "Retry" Тогда
                Если О.Attempts >= VKROutbox.ПределПопыток() Тогда
                    ВызватьИсключение "Лимит попыток исчерпан. История не обнуляется.";
                КонецЕсли;
                Если О.Event.ПометкаУдаления Или НЕ О.Event.Проведен Тогда
                    ВызватьИсключение "Событие отменено: повтор запрещён.";
                КонецЕсли;
                О.NextTry = ТекущаяДатаСеанса();
            КонецЕсли;
            О.State = ЦелевоеСостояние;
            О.Записать();
            ЗаписьРешения.DecisionID = КлючРешения;
            ЗаписьРешения.Notification = Уведомление;
            ЗаписьРешения.DecidedAt = ТекущаяДатаСеанса();
            ЗаписьРешения.OperatorName = ИмяПользователя();
            ЗаписьРешения.PreviousState = ИсходноеСостояние;
            ЗаписьРешения.NewState = О.State;
            ЗаписьРешения.Reason = Обоснование;
            ЗаписьРешения.Записать();
        КонецЕсли;
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры
